var express = require('express');
var router = express.Router();

const moviesList = [
  {
    id: '1',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/644422/w1500_3601014.jpg',
    title: 'Люди в чорному: Інтернешнл',
    titleOriginal: 'Men in Black International',
    slogan: '«Світ сам себе не врятує»',
    year: '2019',
    genres: ['Фантастика', 'Бойовик', 'Пригоди', 'Комедія'],
    description: 'Ви навіть про це не підозрюєте, але існує таємна організація, яка охороняє Землю від різного роду інопланетян і дивних істот. Це Люди в чорному. Як не складно здогадатися, вони майже завжди в чорних ділових костюмах. У них є свої агенти в усіх великих містах на нашій планеті. У кожного з Людей в чорному є нереально круті стволи та пристосування, які допомагають стежити за порядком на Землі, щоб інопланетяни не турбували людей. Час від часу там навіть проводиться набір новачків — так у пару до Агента Н потрапила Агент М. Ці двоє точно добре спрацюються, адже це так весело стріляти по монстрам. Буде багато драйву.',
  },
  {
    id: '2',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/2109552/w1500_45229458.jpg',
    title: 'Ферзевий ґамбіт',
    titleOriginal: 'The Queen’s Gambit',
    slogan: '',
    year: '2020',
    genres: ['Драма', 'Екранізація'],
    description: 'У 1950-х роках у дитячому будинку Кентуккі молода дівчина виявляє вражаючий талант до шахів, одночасно борючись із залежністю.',
  },
  {
    id: '3',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/1469595/w1500_42691730.jpg',
    title: 'Губка Боб: Втеча Губки',
    titleOriginal: 'The SpongeBob Movie: Sponge on the Run',
    slogan: '«Бікіні Ботом лишився позаду»',
    year: '2020',
    genres: ['Мультфільм', 'Пригоди', 'Комедія', 'Сімейний'],
    description: 'Фільм є приквелом до мультсеріалу. В ньому буде показано, як Губка Боб зустрів своїх друзів у Лагері Корал. Однак, втой час Посейдон вкрав Гері улюблинця Губки Боба і відправив Гері у загублине місто Атлантик-Сіті. Тож Губка Боб та його накращий друг Патрік мають туди відправитися щоб врятувати Гері, але Посейдон поставив пастки по дорозі туди.',
  },
  {
    id: '4',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/1595628/w1500_44234246.jpg',
    title: 'Війна з дідусем',
    titleOriginal: 'The War with Grandpa',
    slogan: '«Старигани проти шмаркачів»',
    year: '2020',
    genres: ['Сімейний', 'Комедія', 'Екранізація'],
    description: 'Пітер дуже любить свого дідуся Джека, вони завжди були дуже близькі. Але зовсім недавно старий овдовів, і тому переїжджає до своїх дітей і збирається зайняти кімнату хлопчика. Пітеру явно не подобається перспектива спати на брудному горищі. Хоч хлопчик і любить свого дідуся, але кімната йому дорожча. За допомогою своїх друзів Пітер придумує підступні речі, щоб змусити малорухливого старого віддати кімнату назад. Але дід не з боязкого десятку і ще багато чого може. Війна за кімнату почалася!',
  },
  {
    id: '5',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/355701/w1500_3489246.jpg',
    title: 'У Філадельфії завжди сонячно',
    titleOriginal: 'It’s Always Sunny in Philadelphia',
    slogan: '',
    year: '2005 - 2020',
    genres: ['Комедія'],
    description: 'Цей серіал розповідає про чотирьох друзів, які володіють ірландським баром в поганому районі сонячкої Філадельфії. Вони ворогують між собою, сваряться, брешуть і придумують безумні ідеї, попадаючи в дурацькі та смішні ситуалції.',
  },
  {
    id: '6',
    img: 'https://d2t8nixuow17vt.cloudfront.net/movie/poster/696528/w1500_3123794.jpg',
    title: 'Фарґо',
    titleOriginal: 'Fargo',
    slogan: '',
    year: '2014 - 2020',
    genres: ['Кримінал', 'Драма', 'Трилер', 'Ремейк', 'Антологія'],
    description: 'Для боязкого менеджера з продажу, що працює у власного тестя, викрадення власної дружини — відмінна ідея. Він наймає двох злочинців, щоб за результатами розділити з ними великий викуп за заручницю. Але справа відразу йде не так, як замишлялося, проливається кров … Виклик злочинцям кидає відважна жінка-поліцейський …',
  },
]

/* GET home page. */
router.get('/', function(req, res, next) {
  res.render('movies', {
    title: 'Movies',
    moviesList
  });
});

router.get('/:id', function(req, res, next) {
  const resArr = req.url.split('/')
  
  res.render('movie', {
    title: 'Movies',
    moviesList,
    id: resArr[1] - 1
  });
});

module.exports = router;
