// 2. Дано (вводиться з клавіатури) кількість кілограмів помідорів та вартість одиниці.

// 12. Скільки лампочок потрібно, щоб освітити вулицю довжиною D км, як що стовпи з
// ліхтарями стоять на відстані V м?

// 14. Дано 4 точки (координати): старт, фініш та 2 точки повороту дрона (між точками дрон
// рухався по прямій). Знайти сумарну відстань, яку пролетів дрон.

// 18. Студент ідучи на заняття може використати або трамвай з 2 пересадками, або використати
// потяг і маршрутне таксі, або автобус з 1 пересадкою. Визначити можливі витрати студента,
// якщо вартість квитка не залежить від відстані.