// 6. На складе имеется определённое количество ящиков с яблоками (в нашем примере
// 15). Когда подъезжает машина для погрузки, попросить пользователя ввести, сколько
// ящиков загрузить в первую машину,  во вторую и так далее, пока не закончатся
// ящики с яблоками. Предусмотреть тот случай, когда пользователь введёт
// количество ящиков больше, чем есть на складе.

// let box = 15
// if (box > 0) {
//     let countTruck = 1
//     let truck = parseInt(prompt(`Скільки загрузити в Трак ${countTruck} ящиків? \n
//     На складі залишилося - ${box}`))
//     box = 
// }


