// =========================================
// З клавіатури вводиться кількість сторін багатокутника. Необхідно вивести
// назву фігури («трикутник», «чотирикутник», «п’ятикутинк», «шестикутник»).
// =========================================
// З клавіатури вводиться оцінка за екзамен n , як ціле число. Вивести на екран
// оцінку прописом (“відмінно”,“добре”,“задовільно”,“незадовільно”.
// =========================================
// З клавіатури вводиться номер місяця. Необхідно вивести кількість днів у
// цьому місяці.
// =========================================
// З клавіатури вводиться символ, що є літерою українського алфавіту.
// Визначити, якою є ця літера: голосною чи приголосною.
// =========================================
// З клавіатури вводитися символ. Визначити, чи є цей символ буквою, цифрою,
// розділовим знаком чи іншим символом.
// =========================================
// З клавіатури вводиться номер дня тижня. Вивести на екран назву дня.
// =========================================
// З клавіатури вводиться номер місяця. Вивести на екран номер місяця.
// =========================================
// З клавіатури вводиться номер місяця. Необхідно вивести на екран до якої пори
// року відноситься місяць
// =========================================
// З клавіатури вводиться номер дня тижня. Вивести на екран є цей день робочим
// чи вихідним.
// =========================================
// З клавіатури вводиться позначення категорії («А», «В», «С») , яку вказано у
// водійському посвідченні. Вивести на екран транспортний засіб, яким може
// керувати водій.
// =========================================
// З клавіатури вводиться перша літера розширення файлу («html», «doc», «jpeg»,
// «mp3», «xls»). Вивести на екран назву програми, яка може відкрити цей тип
// файлу.
// =========================================
