/*РОЗВ’ЯЗКИ ВСТАВЛЯЄМО ОДРАЗУ ПІСЛЯ УМОВИ І ПРИСИЛАЄМО ЦЕЙ ЖЕ ДОКУМЕНТ НА ПЕРЕВІРКУ
!!!
Зробити хоча би 5 задач на вибір.
1. Обчислити площу та периметр прямокутника, довжини сторін якого задаються.
2. Дано (вводиться з клавіатури) кількість кілограмів помідорів та вартість одиниці.
3. З клавіатури вводиться рік народження учня. Визначити вік учня.
4. З клавіатури вводиться арендна плата за квартиру (за 1 місяць). Визначити скільки треба
заплатити за 1 рік, за 2 роки та 10 років.

5. З клавіатури вводиться арендна плата за місяць. Визначити на скільки повних місяців
вистачить вказаної суми грошей, а також кількість повних років.

6. Цвях довжиною L см забивають в дошку. За один удар цвях заглиблюється в
дерево на К мм. За скільки ударів цвях заб&#39;ють в дошку?

7. Одна сторінка книжки прочитується за Н хв, в книжці S сторінок. За скільки годин
книжка буде прочитана?

8. Вудкою зловили R риб по G г кожна. Обчисліть загальну вагу спійманої риби в кг.

9. W кг цукерок ділять порівну на М дітей. По скільки г цукерок дістанеться кожній
дитині?

10. Одна серія фільму по телевізору триває F хв. Скільки часу в годинах необхідно,
щоб переглянути N серій?

11. Порося щодня набирає вагу Р г. За скільки днів порося виросте в свиню вагою S
кг?

12. Скільки лампочок потрібно, щоб освітити вулицю довжиною D км, як що стовпи з
ліхтарями стоять на відстані V м?

13. Марічка любить пригощати подруг тістечками в &quot;Солодкій мрії&quot;. Зазвичай,
Марічка з&#39;їдає X тістечок, її подруга Даринка вдвічі більше, а подруга
Катруся на одне тістечко менше, ніж Даринка. Скільки тістечок має
замовити Марічка?
14. Дано 4 точки (координати): старт, фініш та 2 точки повороту дрона (між точками дрон
рухався по прямій). Знайти сумарну відстань, яку пролетів дрон.
15. Користувач хоче клеїти шпалери на стіну. Дано розміри стіни (довжина і висота) та розмір
двох вікон. Визначити, скільки м 2 шпалер потрібно купити користувачу.
16.
Турист їхав Х годин зі швидкістю 40км/год та Y годин зі швидкістю 25км/год. Знайти
загальний пройдений шлях.
17. Визначити загальну вартість покупки, якщо задано вартості та кількості штук двох товарів.
18. Студент ідучи на заняття може використати або трамвай з 2 пересадками, або використати
потяг і маршрутне таксі, або автобус з 1 пересадкою. Визначити можливі витрати студента,
якщо вартість квитка не залежить від відстані.
19. Уряд планує підвищити тарифи на газ на 23% і 15% на електроенергію. На скільки гривень
зросте абонентна плата при вказаних об’ємах споживання (Х кубів газу, Y кіловат
електроенергії)?
20. Заняття на гуртку триває протягом М місяців, з Н годинами на тиждень. Визначити
загальну кількість годин.*/