// =======ДЗ_Функції.docx==START=====
// Задача 0. Створити функцію, яка за номером місяця повертає пору року, до якої відноситься цей
// місяць.

// Задача 1. Створити функцію, яка за номером місяця повертає його назву.

// Задача 2. Створити функцію, яка за номером тижня повертає кількість уроків(так, як у вас було у
// школі).

// Задача 3. Створити окремі функції, які для 4 чисел знаходять:
// 1)суму;
// 2)добуток;
// 3)середнє арифметичне;
// 4)мінімальне значення.

// Задача 4. Створити функцію, яка для 3 заданих чисел знаходить кількість парних.

// Задача 5. Створити функції, які переводять:
// 1) Сантиметри у дюйми;
// 2) Кілограми у фунти;
// 3) Кілометри у милі.

// Задача 6. Створити функцію, яка створює таблицю з вказаною кількістю рядків і стовпців

// Задача 7. Створити функцію, яка випадковим чином виводить на екран одне із 4 зображень (шляхи
// до зображень передаються у функцію)

// Задача 8. Створити функцію, яка виводить банер (у функцію передаються: зображення, заголовок 
// та посилання, куди переходимо при кліку на зображення (тег img повине знаходитись у середині тега 
// a: <a> <img src=”шлях”> </a>
// =======ДЗ_Функції.docx====END=====